{
    "persona": "Persona: Mary Beth\n\nBackground:\nMary Beth is a 45-year-old mother living in Birmingham, Alabama. She is preparing to send her daughter, Sarah Beth, off to her first year at the University of Alabama, where she will be majoring in Elementary Education. Mary Beth is focused on ensuring her daughter has all the necessary supplies for her new dorm room.\n\nDemographics:\nAge: 45\nGender: Female\nEducation: College Graduate\nProfession: Accountant\nIncome: $60,000\nLocation: Birmingham, Alabama\n\nFamily Situation:\nMary Beth is married and has two children. Her eldest, Sarah Beth, is starting college, and her youngest is in high school. The family lives in a modest three-bedroom home in a family-friendly neighborhood. Mary Beth is dedicated to supporting her children's education and is actively involved in their academic lives.\n\nShopping Habits:\nMary Beth is a value-conscious shopper who focuses on quality and practicality. She often shops at Target for dorm supplies due to their good selection and reasonable prices. She prefers to shop online to save time but also enjoys visiting stores to find the best deals. She carefully checks her daughter's dorm checklist to ensure everything needed is purchased.\n\nProfessional Life:\nAs an accountant, Mary Beth is detail-oriented and organized. She applies these skills to managing her household and supporting her children's educational needs. She is focused on making informed decisions about purchases and budgeting effectively.\n\nPersonal Style:\nMary Beth has a classic, practical style that reflects her Southern roots and professional lifestyle. She values functionality and comfort while maintaining a polished appearance. She's known in her community for being helpful and organized, often sharing shopping tips with other parents.",
    "intent": "buy sheets for her daughter's dorm room",
    "age": 45,
    "age_group": "45-54",
    "gender": "female",
    "income": [60000, 60000],
    "income_group": "60,000-69,999"
} 