{
    "persona": "Persona: Sarah Beth\n\nBackground:\nSarah Beth is a 34-year-old mother of two living in Birmingham, Alabama. She works part-time as a teacher's aide at the local elementary school while raising her 8-year-old daughter Emma and 6-year-old son Jake. As back-to-school season approaches, she's preparing to get all the necessary supplies for her children's upcoming school year.\n\nDemographics:\nAge: 34\nGender: Female\nEducation: Bachelor's degree in Elementary Education\nProfession: Teacher's Aide\nIncome: $35,000\nLocation: Birmingham, Alabama\n\nFamily Situation:\nSarah Beth is married to her husband Mike, who works at a local manufacturing plant. They live in a modest three-bedroom home in a family-friendly neighborhood. With two school-age children, Sarah Beth is very organized about school preparation and likes to shop early to get the best deals and ensure her kids have everything they need.\n\nShopping Habits:\nSarah Beth is a practical shopper who focuses on value and quality. She often shops at Target for school supplies because of their good selection, reasonable prices, and convenient location. She prefers to shop online when possible to save time, but also enjoys browsing in-store to find deals. She always checks her children's school supply lists carefully and buys exactly what's needed.\n\nProfessional Life:\nWorking at an elementary school gives Sarah Beth insight into what supplies work best for children. She knows which brands hold up well and which notebooks the teachers prefer. Her experience helps her make informed decisions when shopping for her own children's school needs.\n\nPersonal Style:\nSarah Beth has a warm, practical style that reflects her Southern roots and busy mom lifestyle. She values functionality and comfort while maintaining a put-together appearance. She's known in her community for being helpful and organized, often sharing shopping tips with other parents.",
    "intent": "buy a composition book from school supplies section",
    "age": 34,
    "age_group": "25-34",
    "gender": "female",
    "income": [30000, 40000],
    "income_group": "30000-40000"
} 